ELPasEDT/src/Documents/ШаблонРапортМеханизмыНеблочнойЧасти/ШаблонРапортМеханизмыНеблочнойЧасти.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ШаблонРапортМеханизмыНеблочнойЧасти</name>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ЗначенияПоказателей</name>
    <attributes>
      <name>ГруппаОборудования</name>
      <type>
        <types>CatalogRef.ГруппыОборудования</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеПоказателя1</name>
      <type>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеПоказателя2</name>
      <type>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеПоказателя3</name>
      <type>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеПоказателя4</name>
      <type>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеПоказателя5</name>
      <type>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеПоказателя6</name>
      <type>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеПоказателя7</name>
      <type>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеПоказателя8</name>
      <type>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеПоказателя9</name>
      <type>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеПоказателя10</name>
      <type>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеПоказателя11</name>
      <type>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеПоказателя12</name>
      <type>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеПоказателя13</name>
      <type>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеПоказателя14</name>
      <type>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеПоказателя15</name>
      <type>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ELPasEDT/src/InformationRegisters/НастройкаЗначенийПоказателейМеханизмыНеблочнойЧасти/НастройкаЗначенийПоказателейМеханизмыНеблочнойЧасти.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкаЗначенийПоказателейМеханизмыНеблочнойЧасти</name>
  <resources>
    <name>ТипЗначения</name>
    <type>
      <types>String</types>
      <types>Date</types>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗначениеПоказателя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Синоним</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>60</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ELPasEDT/src/Documents/ШаблонРапортМеханизмыНеблочнойЧасти/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОперативныйЖурнал.ПриСозданииНаСервере(Объект.Ссылка, Элементы, Объект);
	
	ПолучитьДанныеРегистраНастроек();
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьНаСозданныйРанееДокумент()
	
	СтруктураДанных = РапортСервер.ДокументУжеСоздан(Объект.Ссылка.Метаданные(), Объект.Дата, Объект.Подразделение);
	АдресХранилища = ПоместитьВоВременноеХранилище(СтруктураДанных, ЭтаФорма.УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Объект.Ссылка.Пустая() Тогда
		Объект.Дата = ТекущаяДата();
		ПроверитьНаСозданныйРанееДокумент();
		СтруктураДанных = ПолучитьИзВременногоХранилища(АдресХранилища);
		Если Не СтруктураДанных.ДокументРапорта = Неопределено Тогда
			Отказ = Истина;
			РапортКлиент.ПоказатьИнформациюПоРапорту(СтруктураДанных, ЭтаФорма);
		КонецЕсли;
	КонецЕсли;
	
	НастроитьФорму();
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьФорму()
	
	Для Каждого ЭлементФормы Из ЭтаФорма.Элементы Цикл 	
		Если Тип(ЭлементФормы) = Тип("ПолеФормы") И ТипЗнч(ЭлементФормы.Родитель) = Тип("ТаблицаФормы") Тогда
			Если ЭлементФормы.Родитель.Имя = "ЗначенияПоказателей" Тогда
				Для инд = 1 По 15 Цикл
					Если ЭлементФормы.Имя = "ЗначениеПоказателя" + инд Тогда
						СтруктураПараметра = ПолучитьНастройкиРегистра(ЭлементФормы.Имя);
						Если СтруктураПараметра.Количество() = 0 Тогда
							ЭлементФормы.Видимость = Ложь;
						Иначе 				
							ЭлементФормы.Видимость = Истина;
							ЭлементФормы.Заголовок = СтруктураПараметра.Синоним;
						КонецЕсли;				
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;  			
		КонецЕсли;	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьНастройкиРегистра(ИмяПоказателя)
	
	СтруктураПараметра = Новый Структура;
	
	Для Каждого ТекСтр Из ДанныеРегистраНастроек Цикл
		Если ТекСтр.ЗначениеПоказателя = ИмяПоказателя Тогда
			СтруктураПараметра.Вставить("Синоним", ТекСтр.Синоним);
			СтруктураПараметра.Вставить("ТипЗначения", ТекСтр.ТипЗначения);
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат СтруктураПараметра;
	
КонецФункции

&НаСервере
Функция ПолучитьДанныеРегистраНастроек()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НастройкаЗначенийПоказателейМеханизмыНеблочнойЧасти.ЗначениеПоказателя КАК ЗначениеПоказателя,
		|	НастройкаЗначенийПоказателейМеханизмыНеблочнойЧасти.Синоним КАК Синоним,
		|	НастройкаЗначенийПоказателейМеханизмыНеблочнойЧасти.ТипЗначения КАК ТипЗначения
		|ИЗ
		|	РегистрСведений.НастройкаЗначенийПоказателейМеханизмыНеблочнойЧасти КАК НастройкаЗначенийПоказателейМеханизмыНеблочнойЧасти
		|ГДЕ
		|	НастройкаЗначенийПоказателейМеханизмыНеблочнойЧасти.Организация = &Организация";
	
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	
	ДанныеРегистраНастроек.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецФункции

&НаКлиенте
Процедура ЗначениеПоказателяНачалоВыбора(Элемент)
	
	ТипЗначения = ПолучитьНастройкиРегистра(Элемент.Имя).ТипЗначения;
	
	Если ТипЗнч(ТипЗначения) = Тип("Строка") Тогда
		Элемент.ОграничениеТипа = Новый ОписаниеТипов("Строка");
	ИначеЕсли ТипЗнч(ТипЗначения) = Тип("Число") Тогда
		КвалификаторыЧисла = Новый КвалификаторыЧисла(10, 2, ДопустимыйЗнак.Любой);
		Элемент.ОграничениеТипа = Новый ОписаниеТипов("Число", КвалификаторыЧисла);
	ИначеЕсли ТипЗнч(ТипЗначения) = Тип("Дата") Тогда
		Элемент.ОграничениеТипа = Новый ОписаниеТипов("Дата");
	КонецЕсли;    	
	
КонецПроцедуры 

&НаКлиенте
Процедура ЗначениеПоказателя1НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ЗначениеПоказателяНачалоВыбора(Элемент);
КонецПроцедуры  

&НаКлиенте
Процедура ЗначениеПоказателя2НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)  	
	ЗначениеПоказателяНачалоВыбора(Элемент);
КонецПроцедуры 

&НаКлиенте
Процедура ЗначениеПоказателя3НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ЗначениеПоказателяНачалоВыбора(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ЗначениеПоказателя4НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ЗначениеПоказателяНачалоВыбора(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ЗначениеПоказателя5НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ЗначениеПоказателяНачалоВыбора(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ЗначениеПоказателя6НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ЗначениеПоказателяНачалоВыбора(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ЗначениеПоказателя7НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ЗначениеПоказателяНачалоВыбора(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ЗначениеПоказателя8НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ЗначениеПоказателяНачалоВыбора(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ЗначениеПоказателя9НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ЗначениеПоказателяНачалоВыбора(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ЗначениеПоказателя10НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ЗначениеПоказателяНачалоВыбора(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ЗначениеПоказателя11НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ЗначениеПоказателяНачалоВыбора(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ЗначениеПоказателя12НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ЗначениеПоказателяНачалоВыбора(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ЗначениеПоказателя13НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ЗначениеПоказателяНачалоВыбора(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ЗначениеПоказателя14НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ЗначениеПоказателяНачалоВыбора(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ЗначениеПоказателя15НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ЗначениеПоказателяНачалоВыбора(Элемент);
КонецПроцедуры
